<?php
// TODO καλύτερο κείμενο και ευχαριστίες

$abstract = "Η παρούσα πτυχιακή εργασία πραγματεύεται το σχεδιασμό και την ανάπτυξη ενός
δικτύου από «έξυπνες κολώνες» δημόσιου φωτισμού σε περιβάλλον έξυπνης πόλης. Η υλοποίηση
των συστημάτων βασίζεται στο συνδυασμό των δυνατοτήτων που προσφέρουν οι αναπτυξιακές
πλατφόρμες Arduino, ESP32 και Raspberry Pi σε συνδυασμό με τη χρήση αισθητήρων. Η επικοινωνία
μεταξύ αυτών βασίζεται στα πρότυπα ενσύρματων και ασύρματων τοπικών δικτύων, καθώς και της χρήσης
πρωτοκόλλων διαδικτύου. Η διακίνηση των πληροφοριών (από τη συλλογή των δεδομένων των αισθητήρων)
στηρίζεται στο δίκτυο επικοινωνιών που υλοποιείται και η αποθήκευση τους γίνεται με χρήση βάσεων
δεδομένων σε κεντρικό εξυπηρετητή καθώς και σε πλατφόρμα απομακρυσμένης πρόσβασης Internet of Things (IoT).
Απώτερος στόχος είναι η κατασκευή ενός δικτύου από κολώνες φωτισμού, οι οποίες θα συλλέγουν δεδομένα
από τον περιβάλλοντα χώρο, θα διαχειρίζονται αυτόνομα σενάρια αλληλεπίδρασης, όπως η διαχείριση 
του δημόσιου φωτισμού, η συλλογή πληροφοριών του περιβάλλοντος χώρου με χρήση διαφόρων αισθητήρων και θα
παρέχουν στους πολίτες της έξυπνης πόλης χρήσιμο πληροφοριακό υλικό μέσω ιστοσελίδων. Στο πλαίσιο της παρούσας
εργασίας γίνεται μια προσπάθεια παρουσίασης του συνόλου των δομικών στοιχείων που χρησιμοποιήθηκαν στην 
υλοποίηση των συστημάτων, καθώς και των τεχνολογιών που μελετήθηκαν και συνδυάστηκαν με σκοπό την αποτελεσματική
ανάλυση των δεδομένων συλλογής και της απεικόνισης τους. Αναλύονται τεχνολογίες σχετικά με τις 
επικοινωνίες που χρησιμοποιήθηκαν, με τις βάσεις δεδομένων, το διαδίκτυο  (MySQL, Apache Web Server, PHP, JS)
και τα μορφότυπα ανταλλαγής δεδομένων στο διαδίκτυο (XML, JSON). Επίσης γίνεται παρουσίαση της τεχνολογίας
τρισδιάστατης εκτύπωσης (3D print) που χρησιμοποιήθηκε για τη δημιουργία μερών των συστημάτων υλοποίησης. 
Από την πλευρά του λογισμικού γίνεται παρουσίαση των γλωσσών προγραμματισμού που χρησιμοποιήθηκαν στον 
προγραμματισμό των μικροελεγκτών (C++, microPython), στην υλοποίηση της βάσης δεδομένων (JAVA, PHP, SQL) 
και στην διασύνδεση με τις ιστοσελίδες (PHP, JavaScript, Html, CSS). Τέλος, γίνεται σχετική αναφορά σε μελέτες
 πάνω στο αντικείμενο της ανάπτυξης έξυπνου δικτύου δημόσιου φωτισμού.";


return $abstract;